package custom;

public class 筛选装备_死灵 extends 筛选装备_子类 {
    @Override
    public int 物品强度下限() {
        return 760;
    }

    @Override
    public String[] 需求词缀_目标() {
        return new String[]{"攻击速度", "幸运一击几率", "暴击几率", "暴击伤害", "--点力量", "智力", "点智力", "--点敏捷", "--点意力", "点全属性",
                "--核心技能伤害", "抗性", "伤害减免", "易伤伤害", "生命上限", "物理伤害", "距敌人的伤害","冷却时间缩减", "敌人的伤害减免",
                "总护甲", "%伤害", "--资源生成", "--消耗", "召唤","仆从","骷髅","傀儡","移动速度"};
    }

    @Override
    public String[] 不要词缀_目标() {
        return new String[]{"闪避获得","你的药水也会","对受伤敌人的", "基础技能","远距敌人的伤害减免"};
    }

    @Override
    public String[] 必须词缀_目标() {
        return new String[]{};
    }

    @Override
    public int 必须词缀_减少量() {
        return 0;
    }

    @Override
    public int 需求词条数量_要求() {
        return 3;
    }

    @Override
    public void 装备分类(筛选装备.当前装备情况 当前装备情况) {
//        System.out.println(result);
        for (String extractedText : 当前装备情况.是词缀的部分_筛选结果) {
            if (当前装备情况.预类别 == 筛选装备.预类别_枚举.戒指) {
//                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须属性);
//                当前装备情况.必须词缀_目标 = new String[]{"暴击","易伤"};
//                当前装备情况.必须词缀_减少量 = 1;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);
                break;
            } else if (当前装备情况.预类别 == 筛选装备.预类别_枚举.护符) {
//                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须属性);
//                当前装备情况.必须词缀_目标 = new String[]{"冷却时间缩减","法力消耗减免","伤害减免"};
//                当前装备情况.必须词缀_减少量=2;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);

                break;
            } else if (extractedText.contains("双手")) {
                当前装备情况.物品强度下限 = 804;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);
                break;
            } else if (extractedText.contains("手套")) {
//                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须属性);
//                当前装备情况.必须词缀_目标 = new String[]{"暴击"};
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);

                break;
            } else if (extractedText.contains("靴子")) {
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须属性);
                当前装备情况.必须词缀_目标 = new String[]{"移动速度"};
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);

                break;
            } else if (extractedText.contains("胸甲") || extractedText.contains("裤子")) {
                当前装备情况.必须词缀_目标 = new String[]{"生命上限","全属性","伤害减免"};
                当前装备情况.必须词缀_减少量 = 1;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须属性);
                break;
            } else if (extractedText.contains("头盔")) {
//                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须属性);
//                当前装备情况.必须词缀_目标 = new String[]{"全属性"};
//                当前装备情况.必须词缀_减少量 = 1;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);

                break;
            } else if (extractedText.contains("护甲值")) {
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.属性);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                break;
            } else {
                当前装备情况.装备种类 = (筛选装备.装备种类_枚举.未定种类);
            }
        }
    }


    @Override
    public void 自定筛选(筛选装备.当前装备情况 当前装备情况) {
        boolean 自定要求是否满足 = false;
        for (String s : 当前装备情况.是词缀的部分_筛选结果) {
            if (s.contains("移动速度")) {
                自定要求是否满足 = true;
            }
        }

//        筛选逻辑参数.需求词条要求数量--;
        筛选装备.筛选逻辑(当前装备情况);

        if ((当前装备情况.需求词缀数量是否满足)
                && 自定要求是否满足
        ) {
            当前装备情况.所有要求满足 = true;
        }
    }
}
