package custom;

public class 筛选装备_游侠 extends 筛选装备_子类 {
    @Override
    public int 物品强度下限() {
        return 744;
    }

    @Override
    public String[] 需求词缀_目标() {
        return new String[]{"攻击速度", "暴击几率", "暴击伤害","--点力量", "点敏捷", "敏捷","--点智力", "点全属性", "核心技能伤害", "抗性", "伤害减免", "易伤"
                , "生命上限", "物理伤害", "对近距敌人的伤害", "敌人的伤害减免", "总护甲", "%伤害", "使用双持武器", "---毒素灌注", "---所有灌注技能", "------被灌注的技能",
                "能量", "暴击伤害", "---------对受陷阱技能影响敌人", "对中毒敌人","-----毒素伤害","----持续性伤害","恶意","幸运一击几率","被动","主要资源","躲闪"};

    }

    @Override
    public String[] 不要词缀_目标() {
        return new String[]{"受伤状态下的", "对受伤敌人的暴击几率", "被灌注技能的暴击伤害", "能量上限","对中毒敌人的伤害减免","暗影抗性","冰霜抗性"};
    }

    @Override
    public String[] 必须词缀_目标() {
        return new String[]{};
    }

    @Override
    public int 必须词缀_减少量() {
        return 0;
    }

    @Override
    public int 需求词条数量_目标() {
        return 3;
    }

    @Override
    public void 装备分类(筛选装备.当前装备情况 当前装备情况) {
//        System.out.println(result);
        for (String extractedText : 当前装备情况.是词缀的部分_筛选结果) {
            if (当前装备情况.预类别 == 筛选装备.预类别_枚举.戒指) {
                当前装备情况.必须词缀_目标 = new String[]{"暴击","易伤"};
                当前装备情况.必须词缀_减少量 = 1;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (当前装备情况.预类别 == 筛选装备.预类别_枚举.护符) {
                当前装备情况.必须词缀_目标 = new String[]{"伤害减免","能量消耗减免","总护甲"};
                当前装备情况.必须词缀_减少量=2;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (extractedText.contains("匕首") || (extractedText.contains("剑") && !extractedText.contains("双手"))) {
                当前装备情况.物品强度下限 = 805;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                break;
            } else if (extractedText.contains("弓")||extractedText.contains("弩")) {
                当前装备情况.必须词缀_目标 = new String[]{"全属性","敏捷"};
                当前装备情况.必须词缀_减少量=1;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (extractedText.contains("手套")) {
                当前装备情况.必须词缀_目标 = new String[]{"回旋刀锋", "暴击"};
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (extractedText.contains("靴子")) {
                当前装备情况.必须词缀_目标 = new String[]{"全属性"};
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (extractedText.contains("胸甲") || extractedText.contains("裤子")) {
                当前装备情况.必须词缀_目标 = new String[]{"生命上限","全属性","伤害减免","总护甲"};
                当前装备情况.必须词缀_减少量 = 2;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (extractedText.contains("头盔")) {
                当前装备情况.必须词缀_目标 = new String[]{"全属性","总护甲"};
                当前装备情况.必须词缀_减少量 = 1;
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.必须词缀);
                break;
            } else if (extractedText.contains("护甲值")) {
                当前装备情况.装备种类 = 筛选装备.装备种类_枚举.筛选;
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.需求词缀);
                当前装备情况.筛选哪些.add(筛选装备.筛选哪些_枚举.物品强度);
                break;
            } else {
                当前装备情况.装备种类 = (筛选装备.装备种类_枚举.未定种类);
            }
        }
    }


    @Override
    public void 自定筛选(筛选装备.当前装备情况 当前装备情况) {
        boolean 自定要求是否满足 = false;
        for (String s : 当前装备情况.是词缀的部分_筛选结果) {
            if (s.contains("移动速度")) {
                自定要求是否满足 = true;
            }
        }

//        筛选逻辑参数.需求词条要求数量--;
        筛选装备.筛选逻辑(当前装备情况);

        if ((当前装备情况.需求词缀数量是否满足)
                && 自定要求是否满足
        ) {
            当前装备情况.所有要求满足 = true;
        }
    }
}
